{
    "id": "11af3efe-ac8d-49ce-9f01-5cf943ccc8e7",
    "title": "About_CM_Help",
    "content": [
        {
            "type": "text",
            "data": "About Cabinetmaker Help"
        },
        {
            "type": "text",
            "data": "The Cabinetmaker Help System was created in order to make your experience with Cabinetmaker by CABINET VISION more enjoyable and productive. We welcome your feedback so please let us know if you find this information useful by sending an e-mail to us at  tech@cabinetvision.com ."
        },
        {
            "type": "text",
            "data": "The format of this Help System should closely follow the layout of Cabinetmaker itself. Also, you may press the F1 key on your keyboard while using Cabinetmaker to see Help on the area you are using."
        },
        {
            "type": "text",
            "data": "In order to get the most from using the Cabinetmaker Help System, it is important to first know some terms of communication that will be used throughout the Help System."
        },
        {
            "type": "text",
            "data": "First, any time that you are to navigate to a specific area of the ribbonbar to perform a certain function, the sequence will appear as follows:"
        },
        {
            "type": "text",
            "data": "Main|Help|Help Topics..."
        },
        {
            "type": "text",
            "data": "This tells you that you should be on the  Main Tab , then click on  Help , and finally, click on  Help Topics...  in order to get to the specified location."
        },
        {
            "type": "image",
            "data": "image128.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Secondly, it is important to understand the terminology used in describing movements and clicks of the mouse. See the \" Using a Mouse in Cabinetmaker \" topic for more information on using your mouse in Cabinetmaker."
        },
        {
            "type": "link",
            "data": {
                "text": "Using a Mouse in Cabinetmaker",
                "uuid": "6aad7aee-39b5-48df-9e34-4ffc7eb5f963",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "On a mouse with the typical configuration, the left button is used as a Select tool. The right button is used as an alternate select tool. Some mice have a third button or a wheel."
        },
        {
            "type": "text",
            "data": "With this typical configuration, if you see the word  \"click\"  used in this Help System, that means to click one time with the left mouse button on the object specified. A  \"double-click\"  means to click two times in relatively rapid succession on the item or object specified. A  \"right-click\"  means to click one time with the right mouse button on the object specified. Also, you will be asked to  \"drag\"  objects with the mouse at certain times. This means that you will hold the mouse over the specified object, click and hold the left mouse button, then move the mouse while still holding the left button until you reach the area that you were instructed to move the object to. Some objects may be  \"dropped\"  by simply letting go of the left mouse button. Other objects must be  \"dropped\"  by clicking again when you reach the destination. This will be something that you will simply have to practice in order to master."
        },
        {
            "type": "text",
            "data": "Third, when describing buttons on the keyboard, they will appear as images like this:"
        },
        {
            "type": "image",
            "data": "enter_key.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "If there is a sequence of buttons that need to be pressed, it will appear as follows:"
        },
        {
            "type": "text",
            "data": "+   +"
        },
        {
            "type": "image",
            "data": "ctrl_key.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "image",
            "data": "alt_key.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "image",
            "data": "delete.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The above keys must all be pressed in the sequence displayed and each remain depressed until the last key press is performed to get the desired result."
        },
        {
            "type": "text",
            "data": "Next, the Help System will sometimes refer to  \"pull down\"  or  \"drop down\"  or \" combo-box \" menus. Those are both the same type of menu and will be evidenced by an arrow to the right of the selections that you will click on to expand the choices. Here is an example:"
        },
        {
            "type": "image",
            "data": "image1335.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "When you click on the arrow to expand the menu, you will see this:"
        },
        {
            "type": "image",
            "data": "image1336.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Also, as you navigate through the Help System, you will see pictures of many of the windows and Wizards that appear in Cabinetmaker. Many of the tabs and menu items in the pictures may be clicked on to show a more detailed explanation of that feature. Click on the tabs in the illustration below for an example:"
        },
        {
            "type": "image",
            "data": "image172.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "You will also see links to other topics in the Help System. A link will appear like this: click here ."
        },
        {
            "type": "link",
            "data": {
                "text": "click here",
                "uuid": "e5b1c38f-2747-41a5-a7b8-9aefa6986ede",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Context Sensitive Help"
        },
        {
            "type": "text",
            "data": "As you navigate through Cabinetmaker, you can press   for tips specific to the area you are using."
        },
        {
            "type": "image",
            "data": "f1_key.png",
            "description": "[Placeholder for AI-generated description]"
        }
    ],
    "source_file": "CVEnglish_Cabinetmaker\\Introduction\\About_CM_Help.htm",
    "version": "2024",
    "source_type": "help_file"
}