{
    "id": "8b8eb538-238e-4e6c-a59e-e983c45e0d0f",
    "title": "Assembly",
    "content": [
        {
            "type": "text",
            "data": "Assembly"
        },
        {
            "type": "image",
            "data": "image261.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "In the above view of the Assembly Manager, you see an Assembly Construction Method named \"Face Frame\" that uses a Face Frame  Style  of Construction."
        },
        {
            "type": "image",
            "data": "image262.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The Construction Style you select for your Construction Method is very important. This selection determines the Parts available for your Construction Method as well as options within each Part that are specific and necessary for the Style of Construction you need to configure. There are 5 possible Case Construction Styles:"
        },
        {
            "type": "text",
            "data": "Face Frame"
        },
        {
            "type": "text",
            "data": "A face frame in cabinet making is the frame fixed to the front of a cabinet carcass which obscures the edges of the carcass and provides the fixing point for doors and other external hardware. A face frame provides strength to the front of a cabinet and is also considered a visual feature of particular styles of furniture. In CABINET VISION selecting the Face Frame Style turns on the Face Frame Branch and its Parts in the Construction Method. Door Sizing for this Construction Style is controlled by the  Hinge Overlays in the Material Manager ."
        },
        {
            "type": "link",
            "data": {
                "text": "Hinge Overlays in the Material Manager",
                "uuid": "6fb1782e-5d60-4ae1-9801-55624a1651eb",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Frameless"
        },
        {
            "type": "text",
            "data": "Frameless construction in cabinetmaking refers to the construction of cabinets using flat panels of engineered wood, usually particle board, plywood or medium-density fiberboard, rather than the traditional frame and panel construction. Frameless cabinets typically make use of edge banding to conceal the edge of the carcass. This is most commonly seen in European modular-style kitchens. In CABINET VISION selecting the Frameless Style turns off the Face Frame Branch and removes the Machining options from the Construction Method. Door Sizing for this Construction Style is controlled by the  Reveals  within the Exterior Case Branch."
        },
        {
            "type": "link",
            "data": {
                "text": "Reveals",
                "uuid": "3a33e00e-182e-449d-8fa0-b3e602a017ef",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "32 Millimeter"
        },
        {
            "type": "text",
            "data": "Is the same as the Frameless Construction Style visually. In CABINET VISION selecting the 32mm Style turns off the Face Frame Branch and turns on the Machining options from the Construction Method. Door Sizing for this Construction Style is controlled by the  Reveals  within the Exterior Case Branch."
        },
        {
            "type": "link",
            "data": {
                "text": "Reveals",
                "uuid": "3a33e00e-182e-449d-8fa0-b3e602a017ef",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Frame Overlay"
        },
        {
            "type": "text",
            "data": "Is the same as the Face Frame Construction Style with the exception that Doors are sized by the Reveals rather than the Overlays. This allows you to give the look of European Cabinetry (Frameless/32mm) with the added strength of the Face Frame. In CABINET VISION selecting the Frame Overlay Style turns on the Face Frame Branch and its Parts in the Construction Method. Door Sizing for this Construction Style is controlled by the  Reveals  within the Exterior Case Branch.."
        },
        {
            "type": "link",
            "data": {
                "text": "Reveals",
                "uuid": "3a33e00e-182e-449d-8fa0-b3e602a017ef",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Typically, you would want to name your Construction Method something that indicates its contents, for example: If you only have one Face Frame Construction Method, then the name \"Face Frame\" would suffice. However, if you have several Face Frame methods, then your names should be more descriptive like \"Face Frame No Back,\" or \"Face Frame Dado Back.\" Since Style determines Door Sizing this is a very important selection."
        },
        {
            "type": "text",
            "data": "The Branches"
        },
        {
            "type": "text",
            "data": "Following are the available Branches in an Assembly Construction Method:"
        },
        {
            "type": "text",
            "data": "Face Frame"
        },
        {
            "type": "link",
            "data": {
                "text": "Face Frame",
                "uuid": "8f59ef2e-0b95-4a40-a7e0-a9d36e5e2195",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Interior Case"
        },
        {
            "type": "link",
            "data": {
                "text": "Interior Case",
                "uuid": "53c6e181-a84f-4239-b5ed-656d7a312776",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Exterior Case"
        },
        {
            "type": "link",
            "data": {
                "text": "Exterior Case",
                "uuid": "2a3e8318-dae2-4522-9814-f7b1bde65ca3",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Operations"
        },
        {
            "type": "link",
            "data": {
                "text": "Operations",
                "uuid": "cb3e19fa-2c7a-4b60-aa37-377b6adc542a",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Connection"
        },
        {
            "type": "link",
            "data": {
                "text": "Connection",
                "uuid": "190e20aa-379a-4917-a647-6ad47f825039",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "How to Create a New Construction Method"
        },
        {
            "type": "text",
            "data": "There are several ways to begin a new Construction Method. You could start with one of the Construction Methods that are pre-set in CABINET VISION and make modifications to them. You could copy one of the existing Construction Methods and then make changes to the copy so that it meets your requirements. Finally, you could create a brand new Construction Method by clicking on the Create a New Construction Method button (or by clicking on the Construction menu at the top of the Assembly Manager window and then clicking Create New Method). For the purposes of this example, we will create a brand new Construction Method because the options will be the same."
        },
        {
            "type": "text",
            "data": "1.   Click the Create New Construction Method option in the ribbonbar."
        },
        {
            "type": "image",
            "data": "image1867.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "2.   In the pop up window, give the Construction Method a name and select the Construction Style that should apply to this Construction Method. You should also select the Connection Machining to use for the options in the Connections area. Connection Machining is configured through the  Connection Manager ."
        },
        {
            "type": "link",
            "data": {
                "text": "Connection Manager",
                "uuid": "f85b0a07-e86c-4090-84a6-53ebf5f0129a",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "image",
            "data": "image130.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "3.   When you click OK, you will see the following window. Notice that the name of the Construction Method is \"My 32mm Construction\" and the Construction Style is 32 Millimeter."
        },
        {
            "type": "image",
            "data": "image501.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "4.   Next, you should begin to run through the Assembly Manager and answer the questions in each section. Start by clicking on the + symbol next to Interior Case and then double clicking Adjustable Shelf. Double clicking on a branch (such as Adjustable Shelf) runs the Part Wizard for that branch. You can also run the Part Wizard for a branch by clicking the branch to select it and then clicking the Modify option in the ribbonbar. You will then see the following window:"
        },
        {
            "type": "image",
            "data": "image1345.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The Assembly Manager consists mainly of options that you may choose between. In our example, the first option that you must configure concerns Adjustable Shelf banding."
        },
        {
            "type": "text",
            "data": "You will find that the illustrations can be very helpful tools when answering the Assembly Manager questions. The illustrations will change according to the choices that you make and they should give you an idea of what will happen in the Construction Method if certain choices are made. However, you should not be worried if the pictures don't match your Construction 100%. Simply choose the options that most closely resemble your Construction Method."
        },
        {
            "type": "image",
            "data": "Information.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Break Outs"
        },
        {
            "type": "text",
            "data": "When answering questions in the Assembly Manager, you will notice that you are configuring the \"Default\" which applies to all Cabinet Classes. You might however for some reason need to Break Out the question if a different Class object needs a different configuration."
        },
        {
            "type": "text",
            "data": "Example of the use of a Break Out:"
        },
        {
            "type": "text",
            "data": "A classic example of the need to add a break out is when the Top type is different between Base Cabinets and Upper and Tall Cabinets. In this example, we use Stretchers in Base Cabinets and a full Top in the Upper and Tall Cabinets."
        },
        {
            "type": "image",
            "data": "image1346.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "In order to define a different configuration for other Class objects simply click the + Tab next to Default then select the Class you need to define a different Configuration for."
        },
        {
            "type": "image",
            "data": "image1347.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "In this case i have selected Upper and Tall in order to specify full Tops for them."
        },
        {
            "type": "image",
            "data": "image1348.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "5.   Then, simply go through the rest of the questions by answering them and then clicking Next. When you answer the final question in the branch, you will need to click the Finish button."
        },
        {
            "type": "image",
            "data": "image1344.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "6.   When you finish the questions for the first branch, move on to the next one and answer the questions there."
        },
        {
            "type": "text",
            "data": "7.   Complete the rest of the Branches for this Construction Method adding break outs for any situations that require it."
        },
        {
            "type": "text",
            "data": "8.   Test your Construction Method in a Job. The easiest way to begin testing a Construction Method is to create a Job with a single Cabinet. Start out with a single Base Cabinet in the Job making sure that the overall size of the Cabinet is one that you can easily work out a cut list for comparison. Also make sure that you are using a valid Material Schedule for this Job and that each part of the Cabinet is made out of the correct Material."
        },
        {
            "type": "text",
            "data": "Part thickness, which has a huge influence on the cut list, is controlled by the  Material Schedules  and  NOT  the Construction Method. Check each Part of this test Cabinet and make sure that it is sized correctly. For any Parts that are incorrect, try to look at the orthographic views to determine where the problem lies."
        },
        {
            "type": "image",
            "data": "Information.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "link",
            "data": {
                "text": "Material Schedules",
                "uuid": "7a64057c-ee14-4724-b490-38009af08adb",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Next, put a second Base Cabinet next to the first one. Each Cabinet should now have an Unfinished End and other properties that go along with a Cabinet next to another Cabinet."
        },
        {
            "type": "text",
            "data": "Follow the same procedure for Upper Cabinets, Tall Cabinets, Vanity, and finally Corner Cabinets."
        }
    ],
    "source_file": "CVEnglish_Essential\\System_Level\\Ribbonbar\\Main_Tab\\Construction_Group\\Assembly_Manager\\Assembly\\Assembly.htm",
    "version": "2024",
    "source_type": "help_file"
}