{
    "id": "9699cc3e-8177-4d7c-8dd1-72bd718f0b6f",
    "title": "DC_Inside_Edge_Profiles",
    "content": [
        {
            "type": "text",
            "data": "Inside Edge Profiles"
        },
        {
            "type": "text",
            "data": "If you are making your own Doors, what an Inside Edge Profile is, and what it does, is an important concept to understand. The shape of the inside edge cut is not as important as the depth/width of the cut. This is because the shape of the Inside Edge cut is merely decorative while the depth/width of the cut can be used by Solid to size your door parts."
        },
        {
            "type": "text",
            "data": "If you are making a Door with a frame around it and you are using cope & stick construction for the Door, you will not be able to get your Door parts to size correctly until you have selected an Inside Edge Profile to use with that Door that has a \"width\" equal to the \"depth\" of your Door cutters. This is because Solid can add the width of the Inside Edge Profile to each end of the Top Rail, Mid Rail, Bottom Rail, and any Mid Stiles, for the cope & stick."
        },
        {
            "type": "image",
            "data": "Information.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Solid comes preset with some sample Inside Edge Profiles. However if you can’t find one in the list, that matches the depth/width of your Door cutters. You will need to create your own that does match the depth/width of your Door cutters before you will be able to get your Door parts to size correctly."
        },
        {
            "type": "text",
            "data": "When creating Door Profiles the Inside Edge Profile has a property called Applied. What you have set here determines whether the Inside Edge Profile will affect the width of your Stiles and Rails or not. The  Extended Profiles Tab   demonstrates  how the part sizes will be calculated depending on the setting of this option."
        },
        {
            "type": "link",
            "data": {
                "text": "Extended Profiles Tab",
                "uuid": "58bf93c0-395d-4fa5-8f99-421042b7e8ea",
                "description": "[Placeholder for AI-generated description]"
            }
        }
    ],
    "source_file": "CVEnglish_Essential\\Tips_Tricks_&_FAQs\\The_Door_Catalog\\Creating_Doors\\DC_Inside_Edge_Profiles.htm",
    "version": "2024",
    "source_type": "help_file"
}