{
    "id": "6f790c9b-0bd3-4ce6-918a-50f67cc1d4f9",
    "title": "Editing_Assembly_Interiors",
    "content": [
        {
            "type": "text",
            "data": "Editing Assembly Interiors"
        },
        {
            "type": "text",
            "data": "Editing of the Assembly interior is independent of the Assembly face. The face does not necessarily effect the interior as it is edited. Always check the Assembly interior after editing the face to insure your needs are met. Be sure to check out the topic on  Logic Transfer  for information about how to relate the interior Parts to the face sectioning."
        },
        {
            "type": "link",
            "data": {
                "text": "Logic Transfer",
                "uuid": "7a26af93-479b-4a4a-b3ec-b3dbde4236c9",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "To change from face to interior view, select the \"Section Interior\" option. Both the Section view tab and the Section Interior option must be used to access this option."
        },
        {
            "type": "text",
            "data": "The same 4 editing tools are available, Single and Multiple, Horizontal and Vertical division options. When editing the interior of an Assembly, the interior area where the item is to be added is selected, and the appropriate edit tool is clicked. Here an Adjustable Shelf is added. To select the Shelf that we have just added to the Assembly, simply click on it. With the Shelf highlighted in red, the appropriate dot is clicked at the left, here Adjustable Shelf was clicked, thus, an Adjustable Shelf has been added. It could just as easily have been a Roll Out tray."
        },
        {
            "type": "image",
            "data": "SE_2.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Vertical Divisions are done in the same manner, however, they produce Partitions instead of Shelves."
        },
        {
            "type": "text",
            "data": "Deleting Shelves, Trays, etc."
        },
        {
            "type": "text",
            "data": "Items that you have added via the method shown in this topic, can be deleted by highlighting and clicking the large red \"X\" tool located next to the section face and section case tools. Assembly Parts can not be deleted this way. To delete Assembly Parts, use the  Hide Parts  menu option under the Modifications option."
        },
        {
            "type": "link",
            "data": {
                "text": "Hide Parts",
                "uuid": "6d896be3-732c-442a-a6f8-1fc1087514ec",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Tips and Tricks"
        },
        {
            "type": "text",
            "data": "Remember, it is always a good idea to edit an Assembly that has been stretched, shrunk, etc., to the correct size."
        },
        {
            "type": "text",
            "data": "On editing the interior, much like the exterior, the order in which you edit will determine which Parts run long or split. Regardless of how you have set up any  Construction Method , the order that you divide the Assembly interiors determines which Part(s) are long, and which are short. An example would be where a long Partition was desired, with Shelves on each side of the Partition. If the Partition is created before the Shelves, all is well, however, if the Shelves are created before the Partition is created, the Partition will be split by the long Shelves, regardless of how you have defined your Construction Method."
        },
        {
            "type": "link",
            "data": {
                "text": "Construction Method",
                "uuid": "e4cbc02a-f458-4c6d-8725-3c8322a55d94",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "See the topic on  Transferring Logic  from Face parts to Case parts."
        },
        {
            "type": "link",
            "data": {
                "text": "Transferring Logic",
                "uuid": "7a26af93-479b-4a4a-b3ec-b3dbde4236c9",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Consider \" defaulting \" your Assembly before editing it. This has the advantage of eliminating the interior members, and the face members. It allows editing a basic \"box\" that can be rebuilt to meet your needs."
        },
        {
            "type": "link",
            "data": {
                "text": "defaulting",
                "uuid": "6d896be3-732c-442a-a6f8-1fc1087514ec",
                "description": "[Placeholder for AI-generated description]"
            }
        }
    ],
    "source_file": "CVEnglish_Essential\\Tips_Tricks_&_FAQs\\The_Section_Editor\\Editing_Assembly_Interiors.htm",
    "version": "2024",
    "source_type": "help_file"
}