{
    "id": "93f82456-c212-4777-b4b4-6f770410fd17",
    "title": "Import_3D_DXF_Objects",
    "content": [
        {
            "type": "text",
            "data": "Import 3D DXFs into CABINET VISION"
        },
        {
            "type": "text",
            "data": "What is a DXF and Why Would I Use It?"
        },
        {
            "type": "text",
            "data": "DXF stands for Drawing Exchange Format. This drawing format is used with many CAD (Computer Aided Design) programs. It allows drawings, or objects, rendered in one CAD program to be imported and used in another CAD program. DXF files done in AutoCAD\n    DXF format can be imported into CABINET VISION and saved in your object libraries for use in your designs.For example, you have a DXF of a fireplace mantel that you would like to use in CABINET VISION."
        },
        {
            "type": "text",
            "data": "CABINET VISIONwill import AutoCAD Release 12, 13, and 14 DXFs. Most other CAD and modeling programs should work just fine as long as they generate polygon based DXF models. Any non-polygon information within the file (lines, arcs, text, blocks, etc)\n    is ignored. While there havent been any reported problems so far, AutoCAD R14 does have the option to export Release 12 and 13 DXFs."
        },
        {
            "type": "text",
            "data": "Rules for creating the DXFs"
        },
        {
            "type": "text",
            "data": "How the Solid is described"
        },
        {
            "type": "text",
            "data": "The main compatibility problem with importing DXFs into CABINET VISION is that the DXF file specification has several ways to describe polygon-based models."
        },
        {
            "type": "text",
            "data": "Polyface Mesh"
        },
        {
            "type": "text",
            "data": "This object type defines a group of polygons as a single object.This kind of polygon model can be easily imported to CABINET VISION."
        },
        {
            "type": "text",
            "data": "3D Face"
        },
        {
            "type": "text",
            "data": "This defines each polygon as a separate object.These import into CABINET VISION as well."
        },
        {
            "type": "text",
            "data": "3D Mesh"
        },
        {
            "type": "text",
            "data": "Similar, but internally very different, to Polyface Meshes, this type of polygon object cant be directly imported into CABINET VISION.Fortunately, most DXF models exported out of other modeling programs usually produce either Polyface Mesh or 3D Face\n    models.The one huge exception to this is AutoCAD itself: most of its polygon modeling tools creates 3D Mesh objects.In AutoCAD, it is possible to convert 3D Mesh objects to 3D Face by using the \"Explode\"command."
        },
        {
            "type": "text",
            "data": "Materials"
        },
        {
            "type": "text",
            "data": "The other major compatibility issue is how the DXF file specification indicates what materials go on each object. There are three basic ways:by object, by layer, and by color. Models that can be imported into CABINET VISION must have unique materials\n    distinguished  BY LAYER . In the CABINET VISION import dialog, what you are seeing is not individual objects but a list of all the layers within the model. Multiple objects that use the same material are on the same layer.\n    The majority of existing models distinguish materials by layer, but some use the other methods. In fact, it is not uncommon for models to use combinations. For instance, a model may have multiple objects on a single layer, each with a different color.\n    CABINET VISION would import such a model with all objects being the same material: the color information is ignored."
        },
        {
            "type": "text",
            "data": "The 3DS conversion technique described below can be used to convert these to layer based models. In step 2, instead of deriving 3DS objects  BY LAYER , select  BY OBJECT , or  BY COLOR ,\n    as appropriate. It may require some trial and error to find what works best. If all else fails, AutoCAD provides many tools for manually editing objects, colors, and layers."
        },
        {
            "type": "text",
            "data": "Solids"
        },
        {
            "type": "text",
            "data": "Another common way to create models in AutoCAD and other programs is as solids. While similar appearing, solid models are very different from polygon models. CABINET VISION cannot import AutoCAD or other types of solids directly. Your CAD program\n    must be able to convert the solid models into polygon models. In AutoCAD using the 3DS conversion technique described below can do this. The 3DS filter automatically converts solids into polygons."
        },
        {
            "type": "text",
            "data": "3DS Conversion Technique"
        },
        {
            "type": "text",
            "data": "Load DXF or DWG model into AutoCAD. \n \n \n Export model as a 3D Studio (3ds) model.When AutoCAD prompts for it check the box to derive 3DS objects BY LAYER, all other settings default. \n \n \n Clear out the current model and re-import the 3DS model back into AutoCAD.When prompted, set \"Available Materials\"to ADD ALL, \"Save to Layer\"should be set to BY OBJECT, and the other settings should be default.The imported\n        model will be imported as a Polyface Mesh. \n \n \n Now export it as a DXF."
        },
        {
            "type": "text",
            "data": "Load DXF or DWG model into AutoCAD."
        },
        {
            "type": "text",
            "data": "Load DXF or DWG model into AutoCAD."
        },
        {
            "type": "text",
            "data": "Export model as a 3D Studio (3ds) model.When AutoCAD prompts for it check the box to derive 3DS objects BY LAYER, all other settings default."
        },
        {
            "type": "text",
            "data": "Export model as a 3D Studio (3ds) model.When AutoCAD prompts for it check the box to derive 3DS objects BY LAYER, all other settings default."
        },
        {
            "type": "text",
            "data": "Clear out the current model and re-import the 3DS model back into AutoCAD.When prompted, set \"Available Materials\"to ADD ALL, \"Save to Layer\"should be set to BY OBJECT, and the other settings should be default.The imported\n        model will be imported as a Polyface Mesh."
        },
        {
            "type": "text",
            "data": "Clear out the current model and re-import the 3DS model back into AutoCAD.When prompted, set \"Available Materials\"to ADD ALL, \"Save to Layer\"should be set to BY OBJECT, and the other settings should be default.The imported\n        model will be imported as a Polyface Mesh."
        },
        {
            "type": "text",
            "data": "Now export it as a DXF."
        },
        {
            "type": "text",
            "data": "Now export it as a DXF."
        },
        {
            "type": "text",
            "data": "Importing into CABINET VISION"
        },
        {
            "type": "text",
            "data": "A DXF can be imported at the Room or Assembly Level. Both are done relatively the same way, they are just accessed from different area. And if you import at the Job Level its associating the object with the Job, where as if you import at the Assembly\n    Level the object is associated with the Cabinet."
        },
        {
            "type": "text",
            "data": "From the Room or Assembly Level, go to the option  Utilities | Import DXF ."
        },
        {
            "type": "image",
            "data": "image1078.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Whether you are importing at the Room or Assembly Level, this will bring up the browse window to select your DXF. Click on the object to be imported and select  Open ."
        },
        {
            "type": "image",
            "data": "image1081.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "You will automatically be taken to the DXF Import window. You will see the DXF displayed in the preview window. If this is the file you wish to Import, click on the  Type  button. You can always click the action button   to select a different DXF."
        },
        {
            "type": "image",
            "data": "image1082.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "image",
            "data": "image1083.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Next select the Part Type for this DXF Part and click OK. If you have multiple \"Layers\" listed in the Part Type Allocation area you will need to select a Part Type for each \"Layer\"."
        },
        {
            "type": "image",
            "data": "image1084.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "You can now flip or rotate the DXF Part into the preferred orientation by clicking the  Flip  X ,  Flip  Y , and/or  Flip  Z  buttons."
        },
        {
            "type": "image",
            "data": "image1086.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Select  Save  and CABINET VISION will place your DXF. You may have to make additional adjustments to the imported parts positioning. If you Imported this DXF Part at the Room Level you can Save this as a CABINET VISION Object\n    into your Catalog. See the Help file Topic on  Saving Objects  for more information."
        },
        {
            "type": "link",
            "data": {
                "text": "Saving Objects",
                "uuid": "be29a521-2d0f-4030-8911-87f747cacb90",
                "description": "[Placeholder for AI-generated description]"
            }
        }
    ],
    "source_file": "CVEnglish\\Tips_Tricks_FAQs\\FAQs\\HDI-Advanced_Features\\Import_3D_DXF_Objects.htm",
    "version": "2024",
    "source_type": "help_file"
}