{
    "id": "8cd8c491-7f06-4923-bfca-f87652bd7236",
    "title": "Machine_Set",
    "content": [
        {
            "type": "text",
            "data": "Machine Set"
        },
        {
            "type": "text",
            "data": "Machine Sets allow you to group together Machines you have created in the Machine Catalog. Machine Sets are specifically designed for an \"automated\" factory where operations are being performed in line on multiple machines and operations are being consumed until no operations remain. Machine Sets are also a very flexible solution even if you are not running a fully automated factory allowing you to set machine sets to focus certain Materials, Part Types, Operations, etc... onto multiple machines using the Filtering capability. You can also use Machine Sets to send Programs to different Machines and based on workload decide which machine to work them through (see Example 3 below)."
        },
        {
            "type": "text",
            "data": "Example 1"
        },
        {
            "type": "text",
            "data": "Lets say you have a Saw, D&D, and a P2P. The P2P has 5mm Horizontal Bores and the D&D has 8mm Horizontal Bores."
        },
        {
            "type": "text",
            "data": "A Part with only 8mm Horizontal Bores will never get to the P2P because the D&D will consume them first."
        },
        {
            "type": "text",
            "data": "A Part with both 5mm and 8mm Horizontal bores will get a program for the D&D which consumes the 8mm Horizontal bores and then get a program for the P2P which consumes the 5mm Horizontal bores."
        },
        {
            "type": "text",
            "data": "Example 2"
        },
        {
            "type": "text",
            "data": "If you had three machines where machine 1 has 3mm HBores, machine 2 has 5mm HBores, and machine 3 has 8mm HBores."
        },
        {
            "type": "text",
            "data": "A Part with 3mm, 5mm, and 8mm HBores would have programs generated for all 3 Machines."
        },
        {
            "type": "text",
            "data": "Example 3"
        },
        {
            "type": "text",
            "data": "Let's say you   have a Saw and 2 Point-to-Point Machines and you want to spread production load across the 2 Point-to-Point machines and let the shop make the decision for which Point-to-Point to run the programs on. Simply add your 2 Point-to-Point Machines to the Machine Set with your Saw and enable the \" Operations Pass Through \" option for the first of the two Point-to-Point Machines and programs will be created for the job for both Point-to-Point Machines."
        },
        {
            "type": "text",
            "data": "Having each Machine within a Machine Set uniquely Tagged is extremely important especially to get good workflow reporting. The workflow string is the series of machines the part needs to move through. The workflow string is available in  xLabel and for Reports in the  PSNC-xx.mdb . It combines the machine tags of each machine in the workflow process some examples are SAW-DND-P2P, SAW-(PP1/PP2)-(DD1/DD2). Machines in () means the part can be milled from any machine in the brackets. If a part normally can go to a (group) but not all the operations can be milled at each machine in the group then the machines that can't do all the operations will be eliminated. If the only way to get all the operations milled in a (group) is to mill some operations at one machine and other operations at another then the machines will no longer be grouped and only the 1st instance of the operation will be milled."
        },
        {
            "type": "text",
            "data": "See the  Workflow  topic for more information."
        },
        {
            "type": "text",
            "data": "When selecting a Machine Set you have the following options on the Machine tab:"
        },
        {
            "type": "image",
            "data": "image663.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Tag -  This is a short name for the currently selected Machine Set. This option helps a machine operator identify which Barcode on a Label goes with which Machine (Setup). For example the following three examples demonstrate how it is used (displayed). The tags are highlighted in yellow."
        },
        {
            "type": "text",
            "data": "Label for one Secondary Machine"
        },
        {
            "type": "image",
            "data": "image7.jpg",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Same Barcode Sent to Two Different Machines (Machine Set)"
        },
        {
            "type": "image",
            "data": "image8.jpg",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Different Barcode to Two Different Machines (Machine Set)"
        },
        {
            "type": "image",
            "data": "image9.jpg",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Available -  Determines whether the Machine Set is available for Output."
        },
        {
            "type": "text",
            "data": "Machines In Set -  This area is where you assign Machines to your Machine Set. A Machine set can only have one Primary Machine but any number of the other Machine Types. Once you have a Primary Machine included the --BAND PARTS-- option is added to the list and can be used to establish when in the Machine Set process edgebanding is applied to your Parts. This lets the Machine Set know which Machines need to be compensated for Banding and which do not. Those Machines afer the --BAND PARTS-- sequence need to be machined with Edgeband included."
        },
        {
            "type": "text",
            "data": "Available Machines -  These are all the Available Machines in your Machine Catalog. Simply highlight the Machine you want to add to the Machine Set and click the left arrow button to add it."
        },
        {
            "type": "text",
            "data": "Operations Pass Through -  The default action of a Machine Set is to consume operations and once consumed not be passed to the next Machine. With this option enabled the Operations will pass through to all the Machines within the Machine Set. This is a good solution if you want to output programs to multiple Machines and then allow the shop to choose which machine they want to run the programs on."
        },
        {
            "type": "text",
            "data": "Filters -  Any  Filters  you have saved can be applied to a Machine Set in the Filters area. Simply select your saved Filter from the selector (highlighted yellow below) then click the Add button to make it part of the Machine Set."
        },
        {
            "type": "image",
            "data": "image213.png",
            "description": "[Placeholder for AI-generated description]"
        }
    ],
    "source_file": "NCEnglish\\Ribbonbar\\Main_Tab\\Machine\\Machine_Types\\Machine_Set\\Machine_Set.htm",
    "version": "2024",
    "source_type": "help_file"
}