{
    "id": "992d1100-291a-4d28-80e4-ecedaa06d87a",
    "title": "Nine_Basic_Parameters",
    "content": [
        {
            "type": "text",
            "data": "Nine Basic Parameters"
        },
        {
            "type": "text",
            "data": "Parameters"
        },
        {
            "type": "text",
            "data": "A parameter is a characteristic or attribute of an object. In CABINET VISION a room is an object, a cabinet is an object, a part is an object. An example of a parameter would be the length of a part."
        },
        {
            "type": "text",
            "data": "Nine Basic Parameters"
        },
        {
            "type": "text",
            "data": "There are nine basic parameters. For all practical purposes every object in CABINET VISION will have the nine basic parameters, although most objects will have more than the nine basic parameters. The nine basic parameters define the position, size, and rotation, of every object in CABINET VISION. CABINET VISION allows you to access the parameters for an object, ether by going to what is called the \"Object Tree\" or by going to the \"Properties\" for that object or by writing a User Created Standard. The nine basic parameters are as follows:"
        },
        {
            "type": "text",
            "data": "The \"Positional\" parameters are:"
        },
        {
            "type": "text",
            "data": "X, Y, and Z these parameters are used to record the position of an object. Changing the position of an object will change the values stored in one or more of these parameters. See the  Positional Parameters topic  for more information."
        },
        {
            "type": "text",
            "data": "The \"Sizing\" parameters are:"
        },
        {
            "type": "text",
            "data": "DX, DY, and DZ these parameters are used to record the size of an object. Changing the size of an object will change the values stored in one of more of these parameters. See the  Sizing Parameters  topic for more information."
        },
        {
            "type": "text",
            "data": "The \"Rotational\" parameters are:"
        },
        {
            "type": "text",
            "data": "AX, AY, and AZ these parameters are used to record the rotation of an object. Rotating an object will change the values stored in one or more of these parameters. See the  Rotational Parameters  topic for more information."
        }
    ],
    "source_file": "CVEnglish\\Tips_Tricks_FAQs\\Parametric_Editing\\Intelligence_Workshop\\The_Basics\\Nine_Basic_Parameters.htm",
    "version": "2024",
    "source_type": "help_file"
}