{
    "id": "889b9514-979d-4666-80ed-fa37ba231a38",
    "title": "Option_Types_Pane",
    "content": [
        {
            "type": "text",
            "data": "Option Types Pane"
        },
        {
            "type": "text",
            "data": "Option Types are really categories of  Options  that are available at either the Room Level, the Assembly Level, or both. To illustrate, open CABINET VISION, start a new Job, draw a Wall, and select the Generic Catalog. Note the first window contains the list of Option Types on the left side. Listed on the right side are the \"AvailableOptions\". These \"AvailableOptions\" are the available choices for each Option Type, and is also what is listed in the bottom window of the  Options View  in the Catalog Editor."
        },
        {
            "type": "link",
            "data": {
                "text": "Options",
                "uuid": "e820ca9e-d789-4cc3-9365-76dbb9822fa6",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "link",
            "data": {
                "text": "Options View",
                "uuid": "e820ca9e-d789-4cc3-9365-76dbb9822fa6",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "image",
            "data": "image98.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Pictured above is the Option Types Pane as it appears for the Generic Catalog. Job/Room Level Option Types are the ones that appear at the Job or Room Level when the particular Modular Catalog is selected or when a specific Assembly is selected in a Room. Assembly Level Option Types will appear only when a specific Assembly is selected."
        },
        {
            "type": "text",
            "data": "Best practice is to Label Job/Room Level Option Types in all capital letters. Assembly Level Option Types should be Labeled with the first letter capitalized only."
        },
        {
            "type": "text",
            "data": "To create a new Option Type, simply click in the first blank line in the list and enter a Label for that Option Type. The Label should be one that describes the types of  Options  that will appear in conjunction. Then, select the Levels for the Option Type to appear in. For a Job/Room Level Option Type, enter Y in the Job/Room column. For an Assembly Level Option Type, enter a Y in the Assembly column. Entering an N in the desired column will turn that Option Type off in that Level."
        },
        {
            "type": "link",
            "data": {
                "text": "Options",
                "uuid": "e820ca9e-d789-4cc3-9365-76dbb9822fa6",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "If an Option Type is to be available at the Job/Room Level, it should always be available at the Assembly Level as well."
        },
        {
            "type": "image",
            "data": "Information.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The order in which Option Types are displayed can be changed by selecting and highlighting the entire line and holding the SHIFT button while using the Arrow keys on the keyboard to move the item up or down the list."
        }
    ],
    "source_file": "CEEnglish\\Options_View\\Option_Types_Pane.htm",
    "version": "2024",
    "source_type": "help_file"
}