{
    "id": "ce4bdf63-ef44-4054-bb14-0e74dd05d3ea",
    "title": "Overrides",
    "content": [
        {
            "type": "text",
            "data": "Overrides"
        },
        {
            "type": "text",
            "data": "Overrides are simply changes made to an Assembly or a Part that require some value to differ from the  Material Schedule  or  Construction Method  that originally defined it. Schedules or Methods can have Overrides too. Overrides are beneficial when used properly, and dangerous when improperly used. Overrides are limited in reach to the level at which they are created, therefore an Assembly with a Part that has an override in Room 1, will have no effect on other Assemblies in the same Room, or other Rooms. The problems come, if at all, when the Override is accidentally saved back to your  Catalog . If this is done, the Override remains as part of the Assembly, and this may result in a Part or Parts not responding to future changes. There is a simple way to avoid this problem, and that is to never  Save  an Assembly to your Catalog with an Override unless you understand where and why you have created the Override and desire it remain."
        },
        {
            "type": "link",
            "data": {
                "text": "Material Schedule",
                "uuid": "7a64057c-ee14-4724-b490-38009af08adb",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "link",
            "data": {
                "text": "Construction Method",
                "uuid": "e4cbc02a-f458-4c6d-8725-3c8322a55d94",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "link",
            "data": {
                "text": "Catalog",
                "uuid": "0bd2a0d3-bb98-4ed4-a525-50de1e025937",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "link",
            "data": {
                "text": "Save",
                "uuid": "be29a521-2d0f-4030-8911-87f747cacb90",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Understanding an Override"
        },
        {
            "type": "text",
            "data": "You have spent time setting up Schedules and Methods that define how you choose to build Assemblies. As Solid rebuilds your Assembly (as it does at certain times when you make certain modifications), it looks to those Schedules and Methods to determine values for the Assembly components. If it expects to find a value, for instance, 4 inches for the height of a Toe Kick as you have set it in the Assembly Wizard, and it finds a value that differs, it assumes that you have made a change that you desire to keep. Therefore, the Toe Kick will never again re-size to the 4 inches unless you  remove the Override . If you had saved this Assembly back to your Library you would discover that each time you pulled it from your Library, it would have a Toe Kick that reflected the size you had changed it to, and not the 4 inches you have set in the Assembly Wizard. The real danger with Overrides is when they become part of an Assembly by saving it to a Library, as they are useful as a method of changing a single Part of a single Assembly for use in a Job."
        },
        {
            "type": "link",
            "data": {
                "text": "remove the Override",
                "uuid": "6d896be3-732c-442a-a6f8-1fc1087514ec",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Removing Overrides"
        },
        {
            "type": "text",
            "data": "There are two methods of removing overrides. The simplest is from the Assembly Level, Section View. Select the option  Modifications | Default Assembly  answer the prompt affirmatively regarding your intention to Rebuild the Assembly as a Default Assembly. A Default Assembly is a box, it lacks Doors, Drawers, Shelves, and any other interior members it had. You will need to add these Parts back to it, and re-save it to your Library overwriting the existing defective Assembly. The second method is to select the Part that has the Override on it by right clicking on it from an Orthographic view. Select   Properties  and then go to the Overrides Tab. You will see the Override if it exists, in the window. Click on the Override you choose to remove, and click the Remove button. The Part should return to pre-override behavior."
        },
        {
            "type": "link",
            "data": {
                "text": "Modifications | Default Assembly",
                "uuid": "6d896be3-732c-442a-a6f8-1fc1087514ec",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "link",
            "data": {
                "text": "Properties",
                "uuid": "56d7935f-7e10-41ff-8ac3-2dc6df61ae86",
                "description": "[Placeholder for AI-generated description]"
            }
        }
    ],
    "source_file": "CVEnglish_Essential\\Tips_Tricks_&_FAQs\\Overrides.htm",
    "version": "2024",
    "source_type": "help_file"
}