{
    "id": "859cf235-476d-4acd-bb0c-730ec35f6673",
    "title": "Overview_of_Parametric_Editing",
    "content": [
        {
            "type": "text",
            "data": "Overview of Parametric Editing"
        },
        {
            "type": "image",
            "data": "1AUALL.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Parametric editing refers to the addition, deletion, or modification of  Parameters  as they relate to objects within CABINET VISION. An example of a Parameter would be the width (DX) of a Part, the location of a Part (X, Y, or Z), even the material (MatID) of a Part. All of these are necessary to define the Part or object in order for it to become what it needs to be. When the Parameters are missing, or do not represent what you need, the solution is to edit the Parameter by adding, deleting, or modifying it. This is the section where that process is discussed."
        },
        {
            "type": "link",
            "data": {
                "text": "Parameters",
                "uuid": "a4e1b750-0c06-4170-b06e-a29aa6f022c2",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Due to the complexity of parametric editing, do not approach the matter with the expectation that you will understand all there is to learn after working through this group of topics. Parametric editing is an art that is developed and perfected as you work with it. The more you work with it, the more you will learn about it's capabilities. The power of these features are truly awesome, as you will see."
        },
        {
            "type": "text",
            "data": "A final word on mastering these tools. The best teacher is the experience gained through practice. Mistakes encountered as you work with these tools lead to solutions."
        }
    ],
    "source_file": "CVEnglish_Essential\\Overview_of_Parametric_Editing.htm",
    "version": "2024",
    "source_type": "help_file"
}