{
    "id": "7389ea41-e7c5-4b3f-bc39-a0c8925b81a0",
    "title": "Part_and_Object_Orientation",
    "content": [
        {
            "type": "text",
            "data": "Part and Object Orientation"
        },
        {
            "type": "text",
            "data": "The presentation of a Part on your screen occurs because CABINET VISION has applied a mathematical formula that represents information regarding the point of origin of the Part or object, and the final dimension it requires. The use of the  9 Basic Parameters     provides this data. Understanding how these Parameters respond and thereby position Parts and objects is an important part of understanding how intelligence is applied to objects."
        },
        {
            "type": "text",
            "data": "Assemblies widths align along the X axis, with their height following the Y axis. The depth of an Assembly follows the Z axis. On the following graphic, note the back, bottom, left corner of the Assembly as the point of origin and the variables DX,\n    DY, and DZ representing the overall size of the Assembly."
        },
        {
            "type": "image",
            "data": "image412.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Standard Part Orientation"
        },
        {
            "type": "text",
            "data": "All Parts are created equal in Solid. When initially brought into CABINET VISION, they are orientated in the \"standard Part orientation\" that is shown on the following graphic."
        },
        {
            "type": "image",
            "data": "image413.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Notice that the width of a Part follows the X axis (as does an Assembly) the Length follows the Y axis, and the thickness follows the Z axis."
        },
        {
            "type": "text",
            "data": "If this Part were an End Stile, all would be well, as it is orientated correctly for that use. However, it is necessary to rotate Parts so that they will assume the correct orientation for their intended use."
        },
        {
            "type": "text",
            "data": "Assume that the above Part was to be a Bottom Rail, it would need to be rotated from its present position 90 degrees to the right, to orientate itself as a Bottom Rail would. Because ALL Parts; Tops, Backs, Ends, etc. enter CABINET VISION following\n    standard Part orientation, most Parts will have to have a unique rotation applied to it to get it into the correct orientation for it's intended use."
        },
        {
            "type": "text",
            "data": "Rotation that occurs clockwise is a negative rotation, conversely, rotation in a counter clockwise direction is positive rotation. The two are distinguished by adding a \"-\" to the negative rotation, and simply entering the value for the positive\n    rotation (I.E. -90 or 90)."
        },
        {
            "type": "text",
            "data": "The graphic below represents an End Stile that has been rotated -90 degrees along the Z axis. It is now correctly orientated as a Bottom Rail."
        },
        {
            "type": "image",
            "data": "image414.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Notice that the rotation has not changed, the original orientation as far as which axis represents length, width and thickness. The Y axis will remain the axis of the length of the Part regardless of the degree or number of times the Part is rotated.\n    Length is always along the \"Y\" axis, and is always represented by the DY variable. The same for the other axis involved. This is a very important point when, at a later time, you will apply intelligence to a Part and use the parameters of\n    a Part as a parent."
        }
    ],
    "source_file": "CVEnglish\\Tips_Tricks_FAQs\\Parametric_Editing\\Part_and_Object_Orientation.htm",
    "version": "2024",
    "source_type": "help_file"
}