{
    "id": "87e8bd11-edca-48fe-9d44-3dabad2373f6",
    "title": "Plan_and_Elevation_Views",
    "content": [
        {
            "type": "text",
            "data": "Plan and Elevation Views"
        },
        {
            "type": "text",
            "data": "CABINET VISION allows editing of a Room in two views. The Plan   (Floor Plan) and the Elevation      (Wall Face) View. Wall editing (adding or modifying a Wall), however, can only be performed in a Plan view. Other options may be available in one of the two views but not another. Objects added to either view will be seen in both views, assuming the\n    correct area is viewed. Creating or editing a custom Splash is an option of the Elevation view, whereas, creating or accessing a Counter Top is an option of the Plan view only."
        },
        {
            "type": "image",
            "data": "image70.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "image",
            "data": "image71.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The image below shows a group of Cabinets as seen in the Plan View. As a general rule, it is preferable to place Cabinets in this view. Closet Objects, Doors, and Windows favor placement in the Elevation view."
        },
        {
            "type": "image",
            "data": "image1117.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The Elevation View presents Assemblies from the face view as shown below. Assemblies can be placed in this view and stretched. You will only see one Wall at a time in this view, unlike the Plan view where you will see all the Walls within the Room.\n    The properties of this view are controlled by the Layer Schedules. Using the Layer Schedules you can make this view more informative by adding in Shop Annotations that include Architectural Door Swings and the hidden shelves behind the Doors."
        },
        {
            "type": "image",
            "data": "image1118.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Another view related to the Elevation view is the \"Shop View\". In previous versions of CABINET VISION, this view was accessed from the Elevation View, by clicking the \"Shop View\" tool on the toolbar. Now, this view is controlled\n    through layers by turning on the Shop Annotations in the  Layer Schedule   ."
        },
        {
            "type": "link",
            "data": {
                "text": "Layer Schedule",
                "uuid": "41b1dd33-6928-4b99-8d6d-4b7c042a3f92",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "image",
            "data": "2DCAD.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "image",
            "data": "image1119.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "This view is more informative in its representation of the Door swing and the hidden Shelves behind the Doors. Another advantage of this view is that it allows printing from this screen using the Print in the  Quick Access Toolbar .\n    When printed from this view, the drawing is enhanced with information regarding scribe and placement. If this view is sent to drawings, the enhanced information is not provided."
        },
        {
            "type": "link",
            "data": {
                "text": "Quick Access Toolbar",
                "uuid": "a5146ac1-ab67-41ca-b968-c6ff4a1450d1",
                "description": "[Placeholder for AI-generated description]"
            }
        }
    ],
    "source_file": "CVEnglish\\Tips_Tricks_FAQs\\Layout\\Plan_and_Elevation_Views.htm",
    "version": "2024",
    "source_type": "help_file"
}