{
    "id": "e3b5c343-a70a-4deb-8ee8-552e8085f78d",
    "title": "Positional_Parameters",
    "content": [
        {
            "type": "text",
            "data": "Positional Parameters"
        },
        {
            "type": "text",
            "data": "The \"Positional\" parameters are: X, Y, and Z, these parameters are used to record the position of an object, in relation to its parent object, such as an Assembly on a Wall, or a Part in an Assembly. The Wall would be the parent for the Assembly, and the Assembly would be the parent for the Part."
        },
        {
            "type": "text",
            "data": "X = Left and Right"
        },
        {
            "type": "text",
            "data": "The left and right position of an object, also called its X position. A positive adjustment will move the object to the right of its parents \"Reference Point\", while a negative adjustment will move the object to the left of its parents \"Reference Point\". For example if the X position of a Cabinet were 23\" (X = 23), we would know that the Cabinet was 23\" from the left end of the Wall (toward the right end of the Wall). See the diagram below."
        },
        {
            "type": "text",
            "data": "Y = Up and Down"
        },
        {
            "type": "text",
            "data": "The up and down position of an object, also called its Y position. A positive adjustment will move the object up from its parents reference point, while a negative adjustment will move the object down from it parents reference point. For example if the Y position of a Cabinet were 23\" (Y = 23) we would know that the Cabinet was raised 23\" off the floor. See the diagram below."
        },
        {
            "type": "text",
            "data": "Z = Front to Back (or In and Out)"
        },
        {
            "type": "text",
            "data": "The front to back position of an object, also called its Z position. A positive adjustment will move the object forward from its parents reference point, while a negative adjustment will move the object backward from its parents reference point. For example if the Z position of a Cabinet was 23\" (Z = 23) we would know that the Cabinet was 23\" away from the face of the Wall. See the diagram below."
        },
        {
            "type": "text",
            "data": "Position References"
        },
        {
            "type": "image",
            "data": "ebd_Ebd1.gif",
            "description": "[Placeholder for AI-generated description]"
        }
    ],
    "source_file": "CVEnglish\\Tips_Tricks_FAQs\\Parametric_Editing\\Intelligence_Workshop\\The_Basics\\Positional_Parameters.htm",
    "version": "2024",
    "source_type": "help_file"
}