{
    "id": "5014e88e-f060-44bd-8ff6-e9c5059e67d5",
    "title": "Pre-Build",
    "content": [
        {
            "type": "text",
            "data": "Pre-Build"
        },
        {
            "type": "text",
            "data": "This Pre-Build option, when active, determines if the selected UCS is applied before or after the Assembly is built. Select this option when using a UCS to change Assembly Construction Parameters."
        },
        {
            "type": "text",
            "data": "Do not use this option if the UCS Adds, Modifies, or Deletes Parts."
        },
        {
            "type": "image",
            "data": "Warning.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Why This Tool is Available"
        },
        {
            "type": "text",
            "data": "During the Assembly build process, CABINET VISION builds the Assembly according to the parameters generated by the Construction Method first. Then, it applies the UCS's second. In a case where the UCS modifies the value on an Construction Method generated parameter, the parameter was modified (in the Object Tree), but the result was not shown in the way the Assembly was built because it was already built before the UCS modified the value. This required the user to do a Room rebuild to cause the first step of the Assembly build process to recognize the new value on the Construction Method generated parameter. By toggling ON 'Pre-Build', the value of the parameter is modified PRIOR to building the Assembly."
        },
        {
            "type": "text",
            "data": "Intended Use of This Tool"
        },
        {
            "type": "text",
            "data": "Note that this tool is intended ONLY for parameters that affect the way the Assembly Generator builds Parts. For example, a UCS that modifies the DX, DY, DZ, AX, AY, AZ, X, Y, or Z parameters of a Part would NOT use this toggle because these types of parameters will change the size, position, and angle of a Part as soon as the parameter is modified. However, a UCS that modifies or adds parameters such as BKTYPE, ESHAPL, ESHAPR, ETL, or ETR would require the Assembly to be rebuilt AFTER these parameters are modified. The best way to understand this is to think about what the parameter modifies. BKTYPE changes the back type, so the Assembly would need to be rebuilt according to the Construction Method questions for Unfinished or Finished back, depending upon what the BKTYPE parameter indicates the back type should be. ESHAPL and ESHAPR changes the End to go to the floor, so the Assembly would need to be rebuilt with an End that goes to the floor so that the Toe Parts that no longer belong, are removed. ETL and ETR changes the End type, which requires the Assembly to be rebuilt according to the Construction Method questions for the various types of Ends and/or other parameters (Finished, Unfinished, Applied, Applied Door, Clipped, Radius, Angled)."
        },
        {
            "type": "text",
            "data": "How to Determine Whether to Use This Tool on a Particular UCS"
        },
        {
            "type": "text",
            "data": "The best way to determine whether the 'Pre-Build' toggle would be necessary on a particular UCS is to try the UCS with 'Pre-Build' toggled OFF and evaluate results, as follows:"
        },
        {
            "type": "text",
            "data": "If the expected results occur without the toggle and without a Room rebuild, then the 'Pre-Build' toggle is not necessary. \n \n \n If the expected results do NOT occur without the toggle UNLESS the user does a Room rebuild, then the 'Pre-Build' toggle being ON will most likely prevent the user from having to do a room rebuild. \n \n \n If the expected results do NOT occur without the toggle EVEN IF the user does a Room rebuild, then the 'Pre-Build' toggle will not make a difference."
        },
        {
            "type": "text",
            "data": "If the expected results occur without the toggle and without a Room rebuild, then the 'Pre-Build' toggle is not necessary."
        },
        {
            "type": "text",
            "data": "If the expected results occur without the toggle and without a Room rebuild, then the 'Pre-Build' toggle is not necessary."
        },
        {
            "type": "text",
            "data": "If the expected results do NOT occur without the toggle UNLESS the user does a Room rebuild, then the 'Pre-Build' toggle being ON will most likely prevent the user from having to do a room rebuild."
        },
        {
            "type": "text",
            "data": "If the expected results do NOT occur without the toggle UNLESS the user does a Room rebuild, then the 'Pre-Build' toggle being ON will most likely prevent the user from having to do a room rebuild."
        },
        {
            "type": "text",
            "data": "If the expected results do NOT occur without the toggle EVEN IF the user does a Room rebuild, then the 'Pre-Build' toggle will not make a difference."
        },
        {
            "type": "text",
            "data": "If the expected results do NOT occur without the toggle EVEN IF the user does a Room rebuild, then the 'Pre-Build' toggle will not make a difference."
        },
        {
            "type": "text",
            "data": "Examples of UCS's on which this feature would be used:"
        },
        {
            "type": "text",
            "data": "Here are some samples of UCS's where the 'Pre-Build' toggle being ON prevents the user from having to do a Room rebuild:"
        },
        {
            "type": "text",
            "data": "Example #1:"
        },
        {
            "type": "text",
            "data": ";Deletes Finished Back on Cabinets @ Peninsula Walls"
        },
        {
            "type": "text",
            "data": "For Each  Cab Assembly"
        },
        {
            "type": "text",
            "data": "If   :: DZ  <  Imp( . 5)  Then   ;Looks to see if parts belong to cabinet that is on a peninsula wall"
        },
        {
            "type": "text",
            "data": "BKTYPE  =  0"
        },
        {
            "type": "text",
            "data": "End If"
        },
        {
            "type": "text",
            "data": "Example #2:"
        },
        {
            "type": "text",
            "data": ";Links Finished Left End to Cabinet"
        },
        {
            "type": "text",
            "data": "For Each  CAB Assembly"
        },
        {
            "type": "text",
            "data": "ESHAPL  =  2"
        }
    ],
    "source_file": "CVEnglish_Essential\\Pre-Build.htm",
    "version": "2024",
    "source_type": "help_file"
}