{
    "id": "b6307bd2-1eee-4401-8bca-98c5f2305bda",
    "title": "Remove_the_Toe_Notch_from_my_Knee_Drawer_Ends",
    "content": [
        {
            "type": "text",
            "data": "Remove the Toe Notch from my Knee Drawer Ends"
        },
        {
            "type": "text",
            "data": "I have noticed that placing a knee drawer next to a Cabinet, even though the toe is \"deleted\" it becomes a notched toe on the Unfinished End. How do I keep this from happening?"
        },
        {
            "type": "text",
            "data": "If you are using a  Construction Method  that runs the end to the floor for a notched toe it takes precedence over a Cabinet Editor Modification. The reason for this is that CABINET VISION evaluates the End condition then builds the Cabinet in place. When it sees the End condition Finished/Unfinished it looks to the Construction Method for the Job to build the ends, it of course sees End to Floor and it notches the Toe. When placing a cabinet in a Job using that Construction Method for the Job you will get a notched toe."
        },
        {
            "type": "link",
            "data": {
                "text": "Construction Method",
                "uuid": "e4cbc02a-f458-4c6d-8725-3c8322a55d94",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "To keep this from happening, from the System Level Assembly Manager copy your Standard Assembly Construction Method to a new Construction Method called Knee Drawer. In the Knee Drawer Construction method set the Finished and Unfinished ends Deck/Bottom Connection to flush with bottom of Deck/Bottom instead of \"To Floor\". Bring out your Knee Drawer in a new Job. Go to the Section Editor change the Knee Drawers Construction Method to the Knee Drawer Construction Method. Then  save  it to your Catalog click on Advanced and Preserve the Construction Method. From now on when inserting the Knee Drawer it will not Notch the Toes."
        },
        {
            "type": "link",
            "data": {
                "text": "save",
                "uuid": "be29a521-2d0f-4030-8911-87f747cacb90",
                "description": "[Placeholder for AI-generated description]"
            }
        }
    ],
    "source_file": "CVEnglish\\Tips_Tricks_FAQs\\FAQs\\HDI-Advanced_Features\\Remove_the_Toe_Notch_from_my_Knee_Drawer_Ends.htm",
    "version": "2024",
    "source_type": "help_file"
}