{
    "id": "9d837d06-b6f3-456f-b812-67f710f881e2",
    "title": "Resizing_Objects_and_Setting_Dimensions",
    "content": [
        {
            "type": "text",
            "data": "Re-sizing Objects and Setting Dimensions"
        },
        {
            "type": "text",
            "data": "Cabinets and other Objects are saved to your library at default dimensions. Your typical wall cabinet may be 12 inches deep, therefore, you may choose to have that value as the default value. This doesn't mean that it must remain 12 inches deep\n    indefinitely, as it can be stretched or dimensioned to any necessary size, but there must be some default size. You will select this size and modify it as the need occurs, therefore, select this dimension, as well as other dimensions for cabinets\n    that represents your most common need, and choose the \"set as default\" option. This option sets the Default Height, and the Default Depth of your cabinets. From the Layout level, select  Room | Cabinet | Layout     to see your default values."
        },
        {
            "type": "link",
            "data": {
                "text": "Room | Cabinet | Layout",
                "uuid": "cfb61ba6-b4c9-4a53-819a-a4ee588937a9",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "The following graphic shows a cabinet in plan view, after highlighting it. The dots are used for sizing or moving the cabinet as explained on the graphic."
        },
        {
            "type": "image",
            "data": "image1120.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Note also the \"Clearance\" data boxes in the sidebar. These data boxes can be used to place the Assembly in specific locations along the Wall. The \"Clearance\" tool references the available area to the left or right of the Assembly\n    before another object or Wall is encountered. The measurement is from the object that would interfere to the dot on the side of the Assembly, be it left or right. The next series references Position. This is similar, except that it references the\n    Assembly position to the Wall end, regardless of whether there is another object in the way or not. The last series, Center, references the position of the yellow dot in the center of the Assembly to the Wall ends. When the two dimensions are equal,\n    the Assembly is in the center of the wall."
        },
        {
            "type": "text",
            "data": "Entering data in these data boxes can be done by deleting what is there and entering the new data, OR, you can add (or subtract) a value to the value already there. For instance, if the Width box shows an Assembly that is 33 1/16 inches wide, and you\n    wish to reduce it by 5/8 inch, click your mouse to the right of the 6 in 1/16 (do not highlight the entire dimension). The cursor should be a blinking straight line to the right of the 33 1/16. Now, enter a \"-' (minus sign) and 5/8. Press\n    enter. CABINET VISION will treat this as a math equation and change the dimension from 33 1/16 to 32 7/16. To add, use the \"+\" (plus) sign instead of the minus sign. This will work in all of the data boxes on this page."
        }
    ],
    "source_file": "CVEnglish\\Tips_Tricks_FAQs\\Layout\\Resizing_Objects_and_Setting_Dimensions.htm",
    "version": "2024",
    "source_type": "help_file"
}