{
    "id": "c9e4d3b1-5b62-4378-84a2-962b86866d41",
    "title": "RL_What_Are_Layers",
    "content": [
        {
            "type": "text",
            "data": "What Are Layers?"
        },
        {
            "type": "text",
            "data": "Layers are used to control what appears in the different views in CABINET VISION. Layers are like transparent overlays on which you organize and group different kinds of drawing information. The Objects you create have common properties including colors\n    and line-types. An Object can assume these properties from the Layer Schedule chosen. Using Layer Schedules and the Objects on Layers makes it easier to manage the information in your drawings."
        },
        {
            "type": "text",
            "data": "Layers  DO NOT  control what is actually in the Job, they  ONLY  control what you can see on the screen. For example: If you turn off Counter Tops in your Floor Plan View Layer,\n    the Counter Tops are still actually there, they simply won't show up in the Floor Plan View of that Layer."
        },
        {
            "type": "text",
            "data": "Below, you will see a series of images of the same layout with different options selected in the Layer Schedule. The images below are all of exactly the same view in the same Job. No Objects have been removed, only the Layers have been changed."
        },
        {
            "type": "text",
            "data": "The first image shows Base Cabinets, Upper Cabinets, Walls, and Dimensions. Also, the Cabinets are shown in detail (not simply Cabinet outlines)."
        },
        {
            "type": "image",
            "data": "image916.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The next Layer has much of the same information but the Cabinets are shown as outlines only."
        },
        {
            "type": "image",
            "data": "image917.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The next Layer has the Dimensions removed but has added Labels (Object names) to the Cabinets."
        },
        {
            "type": "image",
            "data": "image918.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "In the next Layer, we have turned off the Upper Cabinets. The Upper Cabinets are still in the Job (we have NOT deleted any Cabinets), we have simply turned off the Upper Cabinets so that they do not appear in the Floor Plan View."
        },
        {
            "type": "image",
            "data": "image919.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "In the last picture, we have turned off everything except the Walls. Again, the Cabinets are still there, they simply do not appear in the view because they have been turned off in Layers."
        },
        {
            "type": "image",
            "data": "image920.gif",
            "description": "[Placeholder for AI-generated description]"
        }
    ],
    "source_file": "CVEnglish\\Room_Level\\Ribbonbar\\Main_Tab\\View_Group\\Layers\\RL_What_Are_Layers.htm",
    "version": "2024",
    "source_type": "help_file"
}