{
    "id": "1e708006-de8a-46e7-9ece-5580cad3d4cd",
    "title": "RLCAD_CAD_Layers",
    "content": [
        {
            "type": "text",
            "data": "Top \n > \n \n \n Room Level \n > \n \n Sidebar \n > \n \n CAD \n > \n \n Ribbonbar \n > \n \n Main Tab \n > \n \n CAD Layers"
        },
        {
            "type": "text",
            "data": "Top \n >"
        },
        {
            "type": "text",
            "data": "Room Level \n >"
        },
        {
            "type": "link",
            "data": {
                "text": "Room Level",
                "uuid": "9eaa492c-0405-4da7-8e0f-a6ff4e047890",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Sidebar \n >"
        },
        {
            "type": "link",
            "data": {
                "text": "Sidebar",
                "uuid": "f07520a2-0645-4a40-b8d9-a72c15b5c147",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "CAD \n >"
        },
        {
            "type": "link",
            "data": {
                "text": "CAD",
                "uuid": "c364cda2-94c1-45c4-950a-125c6e19bd95",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Ribbonbar \n >"
        },
        {
            "type": "link",
            "data": {
                "text": "Ribbonbar",
                "uuid": "b2e0e61a-3db8-4e05-86e8-8de0e1729d3d",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Main Tab \n >"
        },
        {
            "type": "link",
            "data": {
                "text": "Main Tab",
                "uuid": "b2e0e61a-3db8-4e05-86e8-8de0e1729d3d",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "CAD Layers"
        },
        {
            "type": "text",
            "data": "CAD Layers"
        },
        {
            "type": "text",
            "data": "CAD Layers"
        },
        {
            "type": "text",
            "data": "CAD Layers are used in CAD and within Drawings Scenes when you edit a Drawing Scene in CAD mode. This list may be different depending on what objects are in the active Scene."
        },
        {
            "type": "text",
            "data": "The following are the possible default Layers when bringing a Scene into CAD."
        },
        {
            "type": "image",
            "data": "image1137.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Molding -  The Molding CAD Layer contains all of the Molding in the selected Scene."
        },
        {
            "type": "text",
            "data": "Counter Tops -  The Counter Tops CAD Layer contains all of the Counter Tops in the selected Scene."
        },
        {
            "type": "text",
            "data": "A ssemblies -  The Cabinets CAD Layer contains all of the Cabinets in the selected Scene."
        },
        {
            "type": "text",
            "data": "Walls -  The Walls CAD Layer contains all of the Walls in the selected Scene."
        },
        {
            "type": "text",
            "data": "Dimensions -  The Dimensions CAD Layer contains all of the Dimensions in the selected Scene."
        },
        {
            "type": "text",
            "data": "Annotations -  The Annotations CAD Layer contains all of the Annotations in the selected Scene."
        },
        {
            "type": "text",
            "data": "When using CAD in \"non-Scene\" areas you can create your own Custom Layers by clicking New... in the Layer Selector. Whichever Layer is selected in the drop down menu is the current Layer and any CAD entities drawn will be on that Layer."
        },
        {
            "type": "text",
            "data": "Hiding the CAD Layers"
        },
        {
            "type": "text",
            "data": "Each of these Layers can be set to hidden by toggling the Light Bulb to grey. When a Layer is hidden; the elements particular to that Layer will not be visible until that Layer is toggled back to visible. In addition, if you add additional CAD details such as dimensions, lines, etc. to a scene then set that Layer to invisible; all of the added CAD details will be hidden as well."
        },
        {
            "type": "text",
            "data": "This can be highly useful when you have a great deal of detail in one area. This can help prevent accidentally editing/deleting the wrong CAD Object as well as making the view clearer for you to work in it. All Drawings sent to the Drawings page as a scene will have a set of Default Layers, which Layers are contained in the Scene is dependent upon the source View of the Scene and/or what is actually contained in the Scene."
        },
        {
            "type": "text",
            "data": "Locking the CAD Layers"
        },
        {
            "type": "text",
            "data": "Each of the CAD Layers include a Lock/Unlock icon. If you click on the Lock icon while it is in the Unlocked position - it will change to Locked and the reverse steps will unlock it. While a CAD Layer is Locked - items in that scene (particular to that Layer) cannot be deleted or modified. Also, items added to that scene (such as Lines, Dimensions, etc) cannot be deleted either. The Lock feature enables you to protect those portions of the scene which you don't want to change."
        },
        {
            "type": "text",
            "data": "You can also add your own CAD Layer(s) when you click on the drop down arrow and click on New. This new CAD Layer  will of course be blank until you add new CAD elements or symbols to it."
        }
    ],
    "source_file": "CVEnglish_Essential\\Room_Level\\Side_Bar\\CAD\\Ribbonbar\\Main_Tab\\RLCAD_CAD_Layers.htm",
    "version": "2024",
    "source_type": "help_file"
}