{
    "id": "2d709712-bc8d-4190-874d-f9140d65da14",
    "title": "RLSB_Order_Entry",
    "content": [
        {
            "type": "text",
            "data": "Top \n > \n \n \n Room Level \n > \n \n Sidebar \n > \n \n Order Entry"
        },
        {
            "type": "text",
            "data": "Top \n >"
        },
        {
            "type": "text",
            "data": "Room Level \n >"
        },
        {
            "type": "link",
            "data": {
                "text": "Room Level",
                "uuid": "9eaa492c-0405-4da7-8e0f-a6ff4e047890",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Sidebar \n >"
        },
        {
            "type": "link",
            "data": {
                "text": "Sidebar",
                "uuid": "f07520a2-0645-4a40-b8d9-a72c15b5c147",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Order Entry"
        },
        {
            "type": "text",
            "data": "Order Entry"
        },
        {
            "type": "text",
            "data": "Order Entry -"
        },
        {
            "type": "image",
            "data": "image185.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "image",
            "data": "image1928.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The Order Entry screen shows a list of everything that appears in the Job and some of the general properties of each item. On the Side Bar you will also see that the Catalogs are accessible so that items may be added to the Job directly through the Order Entry screen. To add an item (such as a Cabinet, Appliance, etc.) simply find that item in the correct Catalog and then drag it out and drop it onto an empty area of the Order Entry list. Adding items in this manner includes those items in all aspects of the Job except the drawings. In other words, if you add items through the Order Entry screen, those items will appear in the Reports and the Bid but will not appear in Floor Plan, Elevation, or 3D views."
        },
        {
            "type": "text",
            "data": "Order entry allows spread sheet style Object management. This tool is useful for viewing your Objects and their configuration for an entire Room, on a single sheet."
        },
        {
            "type": "image",
            "data": "image1120.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "At first the Order Entry screen appears the same as the Cabinet List Report Screen. There are several differences though. The areas highlighted in RED above contain data regarding the Objects in the current Room. That data can be changed at this level. This tool would be useful when furnishing a specific amount of Cabinets, some with Finished Ends Left, Some Right, etc. The advantage is that you do not have to draw Walls, and place Objects, yet, all other features are available, such as cut list, material summaries, section editing, bidding, etc. The Cabinet List at the Report Center does not allow near the data modification available here."
        }
    ],
    "source_file": "CVEnglish_Essential\\Room_Level\\Side_Bar\\RLSB_Order_Entry.htm",
    "version": "2024",
    "source_type": "help_file"
}