{
    "id": "0bd2a0d3-bb98-4ed4-a525-50de1e025937",
    "title": "RLSB_Objects",
    "content": [
        {
            "type": "text",
            "data": "Top \n > \n \n \n Room Level \n > \n \n Sidebar \n > \n \n Objects \n > \n \n Objects"
        },
        {
            "type": "text",
            "data": "Top \n >"
        },
        {
            "type": "text",
            "data": "Room Level \n >"
        },
        {
            "type": "link",
            "data": {
                "text": "Room Level",
                "uuid": "9eaa492c-0405-4da7-8e0f-a6ff4e047890",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Sidebar \n >"
        },
        {
            "type": "link",
            "data": {
                "text": "Sidebar",
                "uuid": "f07520a2-0645-4a40-b8d9-a72c15b5c147",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Objects \n >"
        },
        {
            "type": "link",
            "data": {
                "text": "Objects",
                "uuid": "0bd2a0d3-bb98-4ed4-a525-50de1e025937",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Objects"
        },
        {
            "type": "text",
            "data": "Objects"
        },
        {
            "type": "text",
            "data": "Objects -"
        },
        {
            "type": "image",
            "data": "image70.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "image",
            "data": "image71.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "image",
            "data": "image1919.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Remember that a Wall is required before Objects can be placed."
        },
        {
            "type": "image",
            "data": "Information.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The Custom Cabinets Library will display 4 icons representing 4 Assembly classes, Base, Wall, Tall and Vanity. Select the class icon representing the Assembly class you wish to place, and click on it. The Class will open presenting the members of that Class, as shown in the right hand graphic. Here the Standard Base Cabinet is highlighted. To place this Cabinet on a Wall click on the icon representing the Cabinet, and drag the icon from the sidebar into the Room. Either Plan View or Elevation View allow placement of Objects."
        },
        {
            "type": "image",
            "data": "image1944.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "image",
            "data": "image1945.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "As you drag the icon beyond the right margin of the sidebar your cursor will change to a figure resembling a Cabinet. As soon as your cursor crosses into the Room, release the mouse button and your cursor will again change, this time to a dashed rectangular outline representing the Object you are placing. Move your cursor to the area you would like the Object to occupy. To place the Object, left click and the Object will snap to the Wall closest to your release point. If placing multiple Objects, it is a good idea to overlap the new Object on its neighbor as Solid will compensate for the Object dimensions and move your new Object so that it touches the Object it overlapped, just as if you were installing the Objects side by side. This method prevents the possibility of an error caused when placing Objects and trying to move one to the side of another, as you may be off by 1/8 or 1/4 inch, and at the scale you are working with, this small dimension may not be noticed."
        },
        {
            "type": "text",
            "data": "Once placed, an Object may be moved in several ways. The favored way is to click on the Object, and it will change to an outline with yellow and green dots. Grab the center yellow dot and drag the Objects to it's new location. The center yellow dot is favored because it will not allow you to place an Objects within a Wall, or another Object."
        },
        {
            "type": "image",
            "data": "image22.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The dark green dot, on the other-hand, works the same as the center yellow dot, except it allows placement of the Object anywhere you wish, within a Wall, overlapping another Cabinet, in the middle of the Room, etc."
        },
        {
            "type": "image",
            "data": "image23.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Additionally, the same function of being able to place an Object where it otherwise would not go can be accomplished by dragging the Object from the library, and holding   when you click to place the Object. This is a method of placing an Object in the middle of a Room, as you might do for an island."
        },
        {
            "type": "image",
            "data": "Information.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "image",
            "data": "ctrl_key.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "There is also a light green dot visible on the Object when you have clicked on it. This light green dot allows for rotation of an Object. Typically, the Object follows the Wall, however, when the need arises to have the Object rotated to a different orientation than the Walls, the green dot will allow you to do so."
        },
        {
            "type": "image",
            "data": "image24.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The Yellow dots that appear in the middle of the dashed lines allow for sizing an Object. Click the dot, and drag the dot to a position representing the value you desire to obtain, and the Object will stretch or shrink accordingly."
        },
        {
            "type": "image",
            "data": "image251111.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The below graphic shows an Objects that has been clicked on and is displaying the various colored dots. If you look to the sidebar, in the lower half you will see data boxes representing the dimensions, elevation, outset, and rotation of the Object. Instead of dragging a dot, the desired dimension can be written to the data box and the Object will respond accordingly."
        },
        {
            "type": "text",
            "data": "These data boxes have a unique value in that you can add or subtract to the value within them by clicking to the right of the last digit, and typing either the plus \"+\" or the minus \"-\" sign, and then the value that you wish to add or subtract. Once you have entered the value, and press  , the data box functions like a calculator, computing the new value, and thereafter, modifying the Object to the new value."
        },
        {
            "type": "image",
            "data": "Information.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "image",
            "data": "enter_key.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Object positioning can be as precise as you need it to be. Any Object will display the information shown in the below graphic when activated. This information represents the Objects position on the Wall relative to other Objects on the Wall, as well as the Wall itself. Study the graphic and the number superimposed to represent the values or call of the dimension. Centering the Object can be as simple as entering one half the length of a Wall in the appropriate box, or how accurately you can position the Object for other requirements using these values."
        },
        {
            "type": "image",
            "data": "image843.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The grey square in the right corner is added to the graphic to represent an area that exists when two Walls join. This area represents the depth of the Object type as set in  Layout Properties  and the overlapping of the Objects as they reach the end of their Wall. Because of this condition you will see that the clearance and the position differ in example 2 and 4  above. This represents the difference between Clearance and End Position. Note that the difference is 24 inches (90 - 66 = 24), which happens to be the depth of the Objects on that Wall if it exists. If the above example had an Upper Cabinet instead of a Base Cabinet, the area would be in the neighborhood of 12 x 12 or whatever value you set for the depth of your Uppers."
        },
        {
            "type": "link",
            "data": {
                "text": "Layout Properties",
                "uuid": "cfb61ba6-b4c9-4a53-819a-a4ee588937a9",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "It is a good idea to keep a close eye on the clearance and position of the Objects you place as a means of insuring that the Objects you are placing represent the sizes of the Objects your Job requires. Also, adding clearances to items like Dishwashers or other appliances that require less than 1 inch clearance is much easier when the appliance is dropped on its neighbor, (zero clearance) and the clearance is added to the appropriate data box (right or left clearance). This insures accurate and reliable dimensioning throughout the Job. Another tip that helps insure accuracy is to spend a moment looking at the data in these boxes after placing, editing, or moving an Object. Angle, Outset (distance from Wall) and Elevation (distance above floor) are provided in the lower data boxes above. These data boxes only appear when an Object is activated."
        }
    ],
    "source_file": "CVEnglish_Essential\\Room_Level\\Side_Bar\\Objects\\RLSB_Objects.htm",
    "version": "2024",
    "source_type": "help_file"
}