{
    "id": "08968b11-dcc5-47f4-a3e0-afbafcac65cf",
    "title": "Rotational_Parameters",
    "content": [
        {
            "type": "text",
            "data": "Rotational Parameters"
        },
        {
            "type": "text",
            "data": "The \"Rotational\" parameters are AX, AY, and AZ. These parameters are used to rotate an object. It is very rare to write a formula to rotate a Part, as once you have the Part in an Assembly and rotated into the proper position, you normally don't need the angle of rotation to change. However, it is important to understand how Parts are rotated, because when Parts are rotated it changes the position of  the reference point  for the Part."
        },
        {
            "type": "text",
            "data": "AX = the angle of rotation around the X-axis"
        },
        {
            "type": "text",
            "data": "The X-axis of rotation moves a Part around the X-axis in the same fashion as a gymnast swings around a horizontal bar. Or you could think of it as holding a pencil with the tip pointing to the right so that the length of the pencil is running left and right. You then roll the pencil with you fingers; this is rotation in the AX."
        },
        {
            "type": "image",
            "data": "ebd_Ebd5.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "AY = the angle of rotation around the Y-axis"
        },
        {
            "type": "text",
            "data": "The Y-axis of rotation moves a Part around the Y-axis in the same fashion as the rope of a tether-ball swings around a pole. Or you could think of it as holding a pencil with the tip pointing up so the length of the pencil is running up and down. You then roll the pencil with your fingers; this is rotation in the AY."
        },
        {
            "type": "image",
            "data": "ebd_Ebd6.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "AZ = the angle of rotation around the Z-axis"
        },
        {
            "type": "text",
            "data": "The Z-axis of rotation moves a part around the Z-axis in the same fashion as a propeller rotates on an airplane as you face it. Or you could think of it as holding a pencil with the tip pointing at you so that the length of the pencil is running from front to back. You then roll the pencil with you fingers; this is rotation in the AZ."
        },
        {
            "type": "image",
            "data": "ebd_Ebd7.gif",
            "description": "[Placeholder for AI-generated description]"
        }
    ],
    "source_file": "CVEnglish\\Tips_Tricks_FAQs\\Parametric_Editing\\Intelligence_Workshop\\The_Basics\\Rotational_Parameters.htm",
    "version": "2024",
    "source_type": "help_file"
}