{
    "id": "0a16b7d6-4feb-4d74-9080-522d09c34f87",
    "title": "Second_Exercise_for_the_X_Part_2",
    "content": [
        {
            "type": "text",
            "data": "Second Exercise for the X Part 2"
        },
        {
            "type": "text",
            "data": "See if you can come up with the formula for centering the BOARD yourself. You already know it because you used it to center the BOARD in the cabinet in the first place."
        },
        {
            "type": "text",
            "data": "The BOARD needs to be centered in the cabinet, so we need to know what the center of the cabinet is. The center of the cabinet is  one half of the width of the cabinet . But first we need to know  the width of the cabinet  so we can divide it in half. So we trace  the width of the cabinet  through the tree and it is  \"Cab.Dx\" .  One half of the cabinet width  would be  \"Cab.Dx/2\" . So the first part of our formula is \"Cab.Dx/2\". We would write it down so we wouldnt get confused later."
        },
        {
            "type": "text",
            "data": "The reference point for the second BOARD is on the left side, so we cant just say the X is half the width of the cabinet, because the second BOARD would be off center. We must subtract  one half the width of the second BOARD  from the center of the cabinet. But first we need to know what  the width of the second BOARD  is so we can divide it in half. If you trace it through the tree you will notice that there are two Boards. See the following picture."
        },
        {
            "type": "image",
            "data": "Ex2BoardAt2.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "We want the width of the second BOARD, but how do we tell the program that we want the width of the second BOARD not the first BOARD seeing as they both have the same name?"
        }
    ],
    "source_file": "CVEnglish\\Tips_Tricks_FAQs\\Parametric_Editing\\Intelligence_Workshop\\2nd_Exercise\\Second_Exercise_for_the_X_Part_2.htm",
    "version": "2024",
    "source_type": "help_file"
}