{
    "id": "7a26af93-479b-4a4a-b3ec-b3dbde4236c9",
    "title": "Section_Face_Section_Case_Logic_Transfer",
    "content": [
        {
            "type": "text",
            "data": "Section Face/Section Interior Logic Transfer"
        },
        {
            "type": "text",
            "data": "Solid has a feature that will apply logic from the face of an Assembly to the interior of the Assembly for specific items. These items are similar for face frame and frameless design. The following Parts are recipients of logic from the design of the Assembly Face. Drawer Stretchers, Partitions, and Fixed Shelves. Typically, an Assembly needs a Partition behind two Doors or behind a Mid Stile. It may be desirable that this Partition follow the reveal between the Doors or the Mid Stile as the Doors change Widths. The Partition can be given logic from the Doors to follow their dimensions by using the following procedure."
        },
        {
            "type": "text",
            "data": "Section the face of the Assembly, here two single Doors were added to the face of the Assembly (not a pair of Doors). After the Doors were added, the Section Interior option was clicked. The graphic below is from the Section Interior view. Note the position of the Mid Stile."
        },
        {
            "type": "image",
            "data": "image998.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "In order to give the Partition logic to the Doors, click on the Split Opening Vertically tool without highlighting any portion of the case. After clicking on the tool, click somewhere inside the outline of the Mid Stile. View the side bar to determine the Relative Position placement as \"Left\", \"Right\" or \"Center\". Click on each of these options and the Partition will move accordingly."
        },
        {
            "type": "text",
            "data": "The procedure is similar for all Parts that receive logic from the face."
        }
    ],
    "source_file": "CVEnglish_Essential\\Tips_Tricks_&_FAQs\\The_Section_Editor\\Section_Face_Section_Case_Logic_Transfer.htm",
    "version": "2024",
    "source_type": "help_file"
}