{
    "id": "c724bbee-72b8-4952-bd8b-e45b1bca9e19",
    "title": "Sixth_Exercise_Notes_on_Formulas",
    "content": [
        {
            "type": "text",
            "data": "Sixth Exercise Notes on Formulas"
        },
        {
            "type": "text",
            "data": "In the section that follows, I want you to think about whether or not we need a formula for the parameter in question. Do we? Think about it a little. What should happen to the parts if we change the width, height or depth of the Wood Top? If you need help you can click on \"Answer\"."
        },
        {
            "type": "text",
            "data": "I want you to try and come up with the formula yourself. Think about how the parts are related to the overall size of the Wood Top, and the other parts in the Wood Top. Click on each piece and notice where the reference point is and how it relates to the reference point of the Wood Top (left, bottom, and back corner). If you need help you can click on \"Formula\"."
        },
        {
            "type": "text",
            "data": "Once you have written down your formula, trace it through the tree to get the code and write the code down. If you need help you can click on \"Code\"."
        },
        {
            "type": "text",
            "data": "I have purposely left out the step-by-step instructions for giving the parts intelligence; if you did the five exercises up till now you should know the steps. If you need help refer to the section \" Steps to writing a Formula  \" in the first exercise."
        },
        {
            "type": "link",
            "data": {
                "text": "Steps to writing a Formula",
                "uuid": "b2d84749-364e-4a2f-aa1d-19ee33c71224",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "There is more than one way to skin a cat, so you may come up with a different formula and code than the samples shown here. If you do, try your code and see what happens. If it works, great! Then compare it to what is shown here and see which one you like best."
        }
    ],
    "source_file": "CVEnglish\\Tips_Tricks_FAQs\\Parametric_Editing\\Intelligence_Workshop\\6th_Exercise\\Sixth_Exercise_Notes_on_Formulas.htm",
    "version": "2024",
    "source_type": "help_file"
}