{
    "id": "8dc8d249-bf95-4e42-b01a-d8229c93d0f0",
    "title": "SL_Drawer_Box_Sizing",
    "content": [
        {
            "type": "text",
            "data": "Drawer Box Sizing"
        },
        {
            "type": "text",
            "data": "Drawer Set-Up"
        },
        {
            "type": "text",
            "data": "Setting-up Solid to produce a Drawer Box with the desired finished dimension (Drawer Box set-up) and setting-up the individual Drawer Box Part sizes (Drawer Part set-up) are two separate processes."
        },
        {
            "type": "text",
            "data": "Drawer Box Set-Up"
        },
        {
            "type": "text",
            "data": "Each Drawer Box has a finished overall dimension, a width, height, and depth. We will begin by setting Solid to produce the correct width."
        },
        {
            "type": "text",
            "data": "WIDTH"
        },
        {
            "type": "text",
            "data": "The width of a Drawer Box can be expressed as follows:"
        },
        {
            "type": "text",
            "data": "Opening - Drawer Guide = Drawer Box Width"
        },
        {
            "type": "text",
            "data": "Solid will know the opening, here opening refers to the Case Opening where the Drawer will reside, from information you provide about your Assembly (Cabinet or Closet) Construction and Materials. Solid will determine the value to subtract from this opening to arrive at the Drawer Box width from information you provide in the Material Catalog, Drawer Guides section.  If you look at this screen, you will find the  Drawer Side clearance in the box labeled \"Guide Side Clearance\" (for each side)."
        },
        {
            "type": "image",
            "data": "DB101_1.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Lets assume you entered a value of ½ inch (.5 in.) as a property of the Drawer Guide you wish to use. Further assume that your Case had a clear opening of 21 inches. If you select your Drawer Guide, the value you have entered for the clearance is substituted (times 2).  The formula we used above now looks like this:"
        },
        {
            "type": "text",
            "data": "21 inch opening - (1/2 x 2 or 1) = 20 inch wide Drawer Box."
        },
        {
            "type": "text",
            "data": "Many Drawer Guides work better if there is slightly more than ½ inch allowed for each side, and this is permissible, 9/16 works as well, and would result in a drawer box of 19 7/8 inches wide in our above formula. Remember, you can have many Drawer Guides in your  Material Manager , and, even repeat the same guide when you desire a larger side clearance."
        },
        {
            "type": "link",
            "data": {
                "text": "Material Manager",
                "uuid": "2fed939d-ba55-4f35-94da-993f0e1b392e",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "HEIGHT"
        },
        {
            "type": "text",
            "data": "It is common for Assemblies to have Drawer Boxes that differ in height depending on Drawer location. Two possibilities exist to allow these different heights. Solid may be setup to produce Drawer Box heights of a pre-selected size, an example would be heights of 10, 8, 6, 4, 2.5 inches. By selecting the option to use standard size  Drawer heights , your heights will be limited to one of the pre-selected sizes according to the available clearance and the properties of the Drawer Guide you use."
        },
        {
            "type": "link",
            "data": {
                "text": "Drawer heights",
                "uuid": "c08b0bf8-4db3-4419-a3d0-414780a15cd7",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "image",
            "data": "image961.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Also, in the Material Manager Clearances tab, you will find two places to input a value that relates to the clearance that you want to have for your Drawer from any obstruction above or below the Drawer. These are the \"Minimum Below Box\" and \"Minimum Above Box\" and refer the dimension from the top of the Drawer Box to the below obstruction, and the bottom of the Drawer Box to the obstruction above."
        },
        {
            "type": "image",
            "data": "DBSizing_1.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Assume you had entered as \"Minimum Below Box\" .25 inch, and .75 as the \"Minimum Above Box\"."
        },
        {
            "type": "text",
            "data": "The formula would look like this:"
        },
        {
            "type": "text",
            "data": "Clear vertical opening - top clearance - bottom clearance = drawer height."
        },
        {
            "type": "text",
            "data": "Therefore, if we had a clear vertical opening of 6 inches, and a clearance above and clearance below value that totaled 1 inch, our overall Drawer height would be 5 inches. If we had set up Solid to use the pre-selected sizes listed above, the 4 inch side would have been selected because it would be the first one, going from largest to smallest, to fit. Setting up this method will be covered later."
        },
        {
            "type": "text",
            "data": "This is somewhat simplified as other factors enter into the equation that relate to obstructions. In a Face Frame Cabinet it is simple to see that the face frame opening provides both the clear vertical dimension and the upper and lower obstruction. Therefore, the values you selected for the upper and lower clearance are simply subtracted, and the size is determined. Here is an example of Face Frame."
        },
        {
            "type": "text",
            "data": "Drawer Box height Sizing"
        },
        {
            "type": "image",
            "data": "image17.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Frameless/European type construction is not as simple.  Many builders choose to put a  Drawer Stretcher  below the top Drawer in a Frameless Cabinet. The Drawer face overlays this stretcher by approximately 3/8 inch, this may vary but is sufficient for the discussion."
        },
        {
            "type": "link",
            "data": {
                "text": "Drawer Stretcher",
                "uuid": "68f6d70f-1f07-4c56-be86-4afa27527966",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "When all this is factored into a Drawer height. Our formula for the height of the top Drawer Box height is more complex:"
        },
        {
            "type": "text",
            "data": "Drawer face - overlay at  Top/Top Stretcher  (which is the thickness of the Top/Top Stretcher less the reveal) - overlay at the Drawer Stretcher  - top clearance -\"Min Bottom\" = Drawer Box height."
        },
        {
            "type": "link",
            "data": {
                "text": "Top/Top Stretcher",
                "uuid": "5f65354d-b419-4033-8ad0-837ffa76d81d",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Let's assume a ¼ inch top reveal or an overlay of ½\"(B), and no reveal at the stretcher so the overlay is 3/8 inch (C).  Further, let's keep the ¾\" upper clearance,(D) and the ¼\" bottom clearance (E).  And finally, a 6 inch drawer face (A)."
        },
        {
            "type": "image",
            "data": "image18.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Applying math to the above."
        },
        {
            "type": "text",
            "data": "6\" (drawer face) - (B or ½) -(D or ¾) - (E or ¼) - (C or 3/8) ="
        },
        {
            "type": "text",
            "data": "(6 - 1 7/8) or 4 1/8 inch."
        },
        {
            "type": "text",
            "data": "Now, if you have not selected the standard Drawer height option (we'll cover this selection in a minute), you would see a Drawer Box height of 4 1/8 inch."
        },
        {
            "type": "text",
            "data": "If you go to the Drawer Box and Roll Out Wizard  General Object  the \" Drawer Box Height Specification (#001) \" and select Standard Heights and then continue (Next) to the Drawer Box Standard Heights (#002) option to enter the available Drawer heights. It is very important that you enter your heights from the largest at the top, to the smallest. Do Not skip boxes and place your smallest size in the last box. By selecting this option, you will receive the first size that fits, from largest to smallest. That is to say, if you have 4 5/8 clear, and choices of 10\", 8\", 6\", 4\", 3\", and 2, you will receive the 4 inch side. If you really wanted the 3\" side here, you will have to return to the Material Catalog, Drawer Guide tab, and add to the clearances so that the 4 inch side will be too large. Also, in the event that NONE of the sizes you have entered for your standard heights fit, in other words, they are all too big, Solid will select a Drawer height in the same way it would if the \"Standard Heights\" option were not checked."
        },
        {
            "type": "link",
            "data": {
                "text": "General Object",
                "uuid": "c08b0bf8-4db3-4419-a3d0-414780a15cd7",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "link",
            "data": {
                "text": "Drawer Box Height Specification (#001)",
                "uuid": "c08b0bf8-4db3-4419-a3d0-414780a15cd7",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "image",
            "data": "image962.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Had you selected the Standard Heights, the height would have selected the 4 inch side, as it is the first one to fit from the above example."
        },
        {
            "type": "text",
            "data": "There is a final consideration in the sizing of the Drawer Box heights. If you choose to mount the Drawer Guides in system holes as opposed to drilling new holes for guide mounting, the process will work as described above, however, it will continue to reduce the Drawer Box Height until it finds a system hole to mount to. This may result in Drawer heights shorter than desired. See Assembly Wizard, Operations,  Line Boring  for more information."
        },
        {
            "type": "link",
            "data": {
                "text": "Line Boring",
                "uuid": "cb3e19fa-2c7a-4b60-aa37-377b6adc542a",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Length ( Depth ) of the Drawer Box"
        },
        {
            "type": "link",
            "data": {
                "text": "Depth",
                "uuid": "c08b0bf8-4db3-4419-a3d0-414780a15cd7",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "If you go to the Drawer Box and Roll Out Wizard  General Object  the \" Drawer Box Depth Type (#006) \" and select Standard Depths and then continue (Next) to the Drawer Box Standard Depths (#007) option to enter the available Drawer depths. It is very important that you enter your depths from the longest to shortest. Do Not skip boxes and place your shortest size in the last box. By selecting this option, you will receive the first size that fits, from longest to shortest. Also, the dimension you enter for  Drawer Box Depth Clearance (#005)  refers to the area between the back of the Drawer Box, and the inside face of the Unfinished Back."
        },
        {
            "type": "link",
            "data": {
                "text": "General Object",
                "uuid": "c08b0bf8-4db3-4419-a3d0-414780a15cd7",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "link",
            "data": {
                "text": "Drawer Box Depth Type (#006)",
                "uuid": "c08b0bf8-4db3-4419-a3d0-414780a15cd7",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "link",
            "data": {
                "text": "Drawer Box Depth Clearance (#005)",
                "uuid": "c08b0bf8-4db3-4419-a3d0-414780a15cd7",
                "description": "[Placeholder for AI-generated description]"
            }
        }
    ],
    "source_file": "CVEnglish_Essential\\Tips_Tricks_&_FAQs\\Drawers_&_Roll_Outs\\SL_Drawer_Box_Sizing.htm",
    "version": "2024",
    "source_type": "help_file"
}