{
    "id": "e6158ba8-f6a3-46db-8976-6bbdf5fd8791",
    "title": "Types_of_Orientation",
    "content": [
        {
            "type": "text",
            "data": "Types of Orientation"
        },
        {
            "type": "text",
            "data": "Normal or Front Orientation"
        },
        {
            "type": "text",
            "data": "The face of the Part is toward you. The reference point is in the left, bottom and back corner. See \" Part in Normal Orientation \"."
        },
        {
            "type": "link",
            "data": {
                "text": "Part in Normal Orientation",
                "uuid": "3cb8e90e-a19e-44f6-87c3-1c457fde488a",
                "description": "[Placeholder for AI-generated description]"
            }
        },
        {
            "type": "text",
            "data": "Left Orientation"
        },
        {
            "type": "text",
            "data": "The Part is rotated so that the face of the Part is facing the left and the back of the Part is facing the inside of the Assembly. The right edge of the Part is facing the front of the Assembly. The left edge of the Part is facing the back of the Assembly. The top of the Part is at the top. The bottom of the Part is at the bottom. An example of a Part in left orientation would be a Left End; also all Partitions are left oriented. The reference point would be in the right, bottom and back corner of the Part."
        },
        {
            "type": "text",
            "data": "Right Orientation"
        },
        {
            "type": "text",
            "data": "The Part is rotated so that the face of the Part is facing the right and the back of the Part is facing the inside of the Assembly. The right edge of the Part is facing the back of the Assembly. The left edge of the Part is facing toward the front of the Assembly. The top of the Part is at the top. The bottom of the Part is at the bottom. An example of a Part in right orientation would be a Right End. The reference point would be in the left, bottom and front corner of the Part."
        },
        {
            "type": "text",
            "data": "Top Orientation"
        },
        {
            "type": "text",
            "data": "The face of the Part is facing up; the back of the Part is facing the inside of the Assembly. The top of the Part is facing the right end of the Assembly; the bottom of the Part is facing the left end of the Assembly. The left side of the Part is facing the back of the Assembly; the right side is facing toward the front of the Assembly. An example of a Part in top orientation would be the Top of an Upper Cabinet or the Stretchers in a Base Cabinet. Also all Shelves in an Assembly are top orientated. The reference point is in the left, bottom and back corner of the Part same as a Part in normal orientation."
        },
        {
            "type": "text",
            "data": "Bottom Orientation"
        },
        {
            "type": "text",
            "data": "The face of the Part is facing down; the back of the Part is facing the inside of the Assembly. The left edge is facing the front of the Assembly and the right edge is facing the back of the Assembly. The top is facing the right end of the Assembly and the bottom is facing the left end of the Assembly. An example of a Part that is bottom oriented would be the Deck of a Base Cabinet or the Bottom of an Upper Cabinet. The reference point is in the left, top and front corner of the Part."
        },
        {
            "type": "text",
            "data": "Did you notice how the back (or unfinished side) of the Part is always facing the inside of the Assembly? This is because when you lay Material on a point to point machine, or a router, the face of the Material usually goes down with the back of the Material facing up. The back of the Material is where operations are typically performed. Therefore the back of the Material must face the inside of the Assembly with the face or finished side facing out."
        },
        {
            "type": "image",
            "data": "Information.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "To see the reference point"
        },
        {
            "type": "text",
            "data": "To see the reference point for different Parts right click on a Assembly and then select \"Edit\". While at the Assembly Level click on one of the ortho views. Then click on a Part and its reference point will light up. You will have to click on the same Part in two different views in order to tell exactly where the reference point is visually."
        },
        {
            "type": "text",
            "data": "Also if you look in the sidebar, while you have a Part high-lighted, you will see the \"Left/Right\", \"Up/Down\", and the \"In/Out\" measurements as measured from the reference point of the Assembly to the reference point of the Part you clicked on."
        }
    ],
    "source_file": "CVEnglish\\Tips_Tricks_FAQs\\Parametric_Editing\\Intelligence_Workshop\\The_Basics\\Types_of_Orientation.htm",
    "version": "2024",
    "source_type": "help_file"
}