{
    "id": "01768bdf-1599-438e-8577-4bdc4c540560",
    "title": "Work_Planes",
    "content": [
        {
            "type": "text",
            "data": "Work Planes"
        },
        {
            "type": "image",
            "data": "1AUALL.png",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "Work planes, will allow you to easily add operations to faces or edges of a Part without having to think about positions and rotations. The front and back face of a Part can be considered face work-planes and each edge of the Part will be considered an edge work plane. Face work planes are numbered 1 for the front face and 2 for the back face. Edge work planes are enumerated in a counter clock-wise direction from the shape origin on a shaped part or the bottom left corner of a rectangular part. This functionality will not work on radiused edges."
        },
        {
            "type": "image",
            "data": "image836.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "The edge work planes are oriented by following the Part edges from the origin moving in a counter clock-wise direction. The Y axis will be along the front face of the Part toward the next shape node and the X axis will be from the front face toward the back of the Part as shown on the following sketch."
        },
        {
            "type": "image",
            "data": "image837.gif",
            "description": "[Placeholder for AI-generated description]"
        },
        {
            "type": "text",
            "data": "To position an operation on a work plane, create the operation as if it were in a normal Cartesian (XY) coordinate system. The Z position and AX, AY and AZ rotations will typically be 0. The operation can then be applied to an edge by specifying the edge work plane with an _EDGWP parameter. The value will specify which edge to place the work plane on, eg: _EDGWP=3 will position the operation on the 3rd edge. The operation can also be applied to a face with a _FACEWP parameter, eg: _FACEWP=2 will put the operation on the back face."
        },
        {
            "type": "text",
            "data": "There are also additional lower level parameters that can be used to get information about an edge. The values returned are for the edges orientation and position in Parts space. One set of parameters assumes the edge orientation as described for the work planes. The parameters are as follows (# is the edge number):"
        },
        {
            "type": "text",
            "data": "_edg#x"
        },
        {
            "type": "text",
            "data": "returns the x origin of the edge"
        },
        {
            "type": "text",
            "data": "_edg#y"
        },
        {
            "type": "text",
            "data": "returns the y origin of the edge"
        },
        {
            "type": "text",
            "data": "_edg#z"
        },
        {
            "type": "text",
            "data": "returns the z origin of the edge"
        },
        {
            "type": "text",
            "data": "_edg#dy"
        },
        {
            "type": "text",
            "data": "returns the length of the edge"
        },
        {
            "type": "text",
            "data": "_edg#ax"
        },
        {
            "type": "text",
            "data": "returns the x rotation of an operation (work plane) placed on the edge"
        },
        {
            "type": "text",
            "data": "_edg#ay"
        },
        {
            "type": "text",
            "data": "returns the y rotation of an operation (work plane) placed on the edge"
        },
        {
            "type": "text",
            "data": "_edg#az"
        },
        {
            "type": "text",
            "data": "returns the z rotation of an operation (work plane) placed on the edge"
        },
        {
            "type": "text",
            "data": "_edg#miter"
        },
        {
            "type": "text",
            "data": "returns the miter angle of the edge"
        },
        {
            "type": "text",
            "data": "_shpedgcnt"
        },
        {
            "type": "text",
            "data": "Returns the number of edges a shaped Part has. It will return 0 if the part is not   shaped. A bend line or radius node count as 1 edge."
        },
        {
            "type": "text",
            "data": "Arcs and Curves are ignored in the Work Plane counts and can not be referenced."
        },
        {
            "type": "image",
            "data": "Information.png",
            "description": "[Placeholder for AI-generated description]"
        }
    ],
    "source_file": "CVEnglish_Essential\\Work_Planes.htm",
    "version": "2024",
    "source_type": "help_file"
}